## Obtener el promedio general sólo para aquellos alumnos que aprobaron Matemática en el archivo Datos.xlsx.

In [29]:
import pandas as pd
import numpy as np

datos2 = pd.read_excel("Datos2.xlsx") 
print("Datos:\n")
print(datos2)

Datos:

   Legajo Nombre    Apellido Quimica Matematica  Fisica
0   34567   Juan    Martinez      10        NaN     9.0
1   34678  Pablo    Gonzales       4          9     4.0
2   34234  Maria  Citanovich       A          4     4.0
3   35679    Sol        Rios       9          8    10.0
4   36789  Paula       Lagos       8          A     8.0
5   32578  Tomas         Reu       1          4     NaN

In [28]:
filtro = datos2[(datos2['Matematica'].notna()) & (datos2['Matematica'] != 'A')]
filtro

   Legajo Nombre    Apellido Quimica Matematica  Fisica
1   34678  Pablo    Gonzales       4          9     4.0
2   34234  Maria  Citanovich       A          4     4.0
3   35679    Sol        Rios       9          8    10.0
5   32578  Tomas         Reu       1          4     NaN

In [33]:
filtro.replace(np.nan, 0, inplace = True)
filtro.replace('A', 0, inplace= True)
filtro

   Legajo Nombre    Apellido  Quimica  Matematica  Fisica
1   34678  Pablo    Gonzales        4           9     4.0
2   34234  Maria  Citanovich        0           4     4.0
3   35679    Sol        Rios        9           8    10.0
5   32578  Tomas         Reu        1           4     0.0

In [45]:
promedio = (filtro['Quimica'] + filtro['Matematica'] + filtro['Fisica']) / 3
filtro['Promedio General'] = round(promedio, 2)
filtro.drop('Promedio', axis = 1, inplace = True)
filtro

   Legajo Nombre    Apellido  Quimica  Matematica  Fisica  Promedio General
1   34678  Pablo    Gonzales        4           9     4.0              5.67
2   34234  Maria  Citanovich        0           4     4.0              2.67
3   35679    Sol        Rios        9           8    10.0              9.00
5   32578  Tomas         Reu        1           4     0.0              1.67